Revit 2027 API
FaceWall.IsValidFaceReferenceForFaceWall Method
 Identifies if a reference may be used as the parent of a face wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidFaceReferenceForFaceWall(
	Document document,
	Reference faceReference
)
Public Shared Function IsValidFaceReferenceForFaceWall (
	document As Document,
	faceReference As Reference
) As Boolean
public:
static bool IsValidFaceReferenceForFaceWall(
	Document^ document,
	Reference^ faceReference
)
static member IsValidFaceReferenceForFaceWall :
        document : Document *
        faceReference : Reference -> bool
Parameters
document Document
 The document.
faceReference Reference
 The reference.
Return Value
Boolean
 True if the reference is valid as a parent to a face wall, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The reference must represent a face of a massing instance, and must be planar, and its normal must not be vertical or horizontal.
See Also
Reference
FaceWall Class
Autodesk.Revit.DB Namespace